---
kind: type
id: T:Autodesk.Revit.DB.ElementTransformUtils
source: html/82e737d5-fda4-bc10-6099-88999cd51300.htm
---
# Autodesk.Revit.DB.ElementTransformUtils

A collection of utilities allowing transformation of elements (e.g. move, rotate, mirror and copy).

## Syntax (C#)
```csharp
public static class ElementTransformUtils
```